# ---------------------------------  Настройка бота  ----------------------------------- #

version = "1.2.0"

# ---------------------------------  Данные  ----------------------------------- #

type_of_lessons_dict = {
    'LECTURE': 'лекция 😴',
    'SEMINAR': 'семинар 📗',
    'COMMON_MINOR': 'Майнор Ⓜ',
    'ENGLISH': 'английский 🆎',
    'EXAM': 'экзамен ☠️',
    'INDEPENDENT_EXAM': 'независимый экзамен ☠️☠️',
    'TEST': 'зачёт ☠️',
    'PRACTICE': 'практика 💼',
    'MINOR': 'Майнор Ⓜ',
    'COMMON_ENGLISH': 'английский 🆎',
    'STATEMENT': 'ведомость 📜',
    'ICC': 'МКД 📙',
    'UNDEFINED_AED': 'ДОЦ по выбору 📕',
    'AED': 'ДОЦ 📕',
    'CONSULT': 'консультация 🗿',
    'EVENT': 'мероприятие'
}

type_of_program_dict = {
    'МБ': 'Международный бакалавриат по бизнесу и экономике',
    'РИС': 'Разработка информационных систем для бизнеса',
    'И': 'История',
    'ИЯ': 'Иностранные языки',
    'Ю': 'Юриспруденция',
    'УБ': 'Управление бизнесом',
    'Э': 'Экономика',
    'ПИ': 'Программная инженерия',
    'БИ': 'Бизнес-информатика'
}

number_of_pair_dict = {
    '8:10': '1-ая пара',
    '9:40': '2-ая пара',
    '11:30': '3-ая пара',
    '13:10': '4-ая пара',
    '15:00': '5-ая пара',
    '16:40': '6-ая пара',
    '18:20': '7-ая пара',
    '20:10': '8-ая пара'
}

count_pairs_dict = {
    '1': '1 пара 🥳',
    '2': '2 пары 🙂',
    '3': '3 пары 😐',
    '4': '4 пары 😟',
    '5': '5 пар 😨',
    '6': '6 пар 😱',
    '7': '7 пар 😵',
    '8': '8 пар ☠'
}

emojies_for_course = ['📒', '📓', '📔', '📕', '📗', '📘', '📙']
emojies_for_programs = ['🌶', '🍑', '🍉', '🍏', '🍍', '🥭', '🍆', '🍐', '🍋', '🍇', '🍒', '🥝', '🥥']
emojies_for_groups = ['⚪', '🔴', '🟡', '🟢', '🟣', '🟤', '🔵', '⚫']
emojies_for_subgroups = ['🌁', '🌃', '🌄', '🌅', '🌆', '🌇', '🌉']

# emojies_for_number_of_pair = ['1️⃣', '2️⃣', '3️⃣', '4️⃣', '5️⃣', '6️⃣', '7️⃣', '8️⃣', '9️⃣']
