EXCEPTION_MESSAGE = "Что-то пошло не так 🤷\n" \
                    "Попробуй еще раз или чуть позже.\n\n" \
                    "Если проблема не исчезнет обратись в поддержку: @hse_perm_helper_support_bot"
SUCCESS_REGISTER = "✅ Ты успешно зарегистрировался!"
SUCCESS_DATA_CHANGING = "✅ Данные успешно изменены!"

SERVICE_UNAVAILABLE_EXCEPTION = ("Сервис {service} недоступен 😔\n"
                                 "Попробуйте повторить попытку через пару минут")

UNREGISTERED_USER_EXCEPTION = ("Ты не зарегистрирован 😔\n\n"
                               "Пройди регистрацию (/start) и возвращайся 😎")

CONNECTION_ERROR = ("Сервер недоступен 😔\n"
                    "Попробуйте повторить попытку через пару минут")
